controllers/BookController.php

INSERT INTO `book` (`booksname`, `author`, `press`, `publicationdate`, `lenddate`, `returndate`, `lendername`, `lenderid`) VALUES ('测试数据', '测试作者', '测试出版社', '2018-12-05', '2018-11-04', '2018-11-11', '毛美丽', 12)
---
    public function actionCreate()
    {
        $result = array("code" => 0,"message" => "");
        $model = new Book();
        if ($model->load(Yii::$app->request->post()) && $model->save()) {